# Реализовать скрипт, в котором должна быть предусмотрена функция расчета заработной платы сотрудника.
# В расчете необходимо использовать формулу: (выработка в часах * ставка в час) + премия.
# Для выполнения расчета для конкретных значений необходимо запускать скрипт с параметрами.


def salary():
    try:
        time = float(input('Выработка в часах '))
        labor = int(input('Ставка в час '))
        bonus = int(input('Премия '))
        res = time * labor + bonus
        print(f'заработная плата сотрудника  {res}')
    except ValueError:
        return print('Вы ввели не число')


salary()
